# AssemblyMemberDifferentType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyMemberDifferentType Class
Members See Also
---
The two assembly members being compared have different type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AssemblyMemberDifferentType : AssemblyMemberDifference
```

Visual Basic
---
```text
Public Class AssemblyMemberDifferentType _
	Inherits AssemblyMemberDifference
```

Visual C++
---
```text
public ref class AssemblyMemberDifferentType : public AssemblyMemberDifference
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AssemblyMemberDifference Autodesk.Revit.DB..::..AssemblyMemberDifferentType
# See Also
AssemblyMemberDifferentType Members
Autodesk.Revit.DB Namespace